Revit 2027 API
Reference.LinkedElementId Property
The id of the top-level element in the linked document that is referred to by this reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LinkedElementId { get; }
Public ReadOnly Property LinkedElementId As ElementId
	Get
public:
property ElementId^ LinkedElementId {
	ElementId^ get ();
}
member LinkedElementId : ElementId with get
Property Value
ElementId
Remarks
InvalidElementId will be returned for references that don't refer to an element in a linked RVT file.
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace